es_result = {
    "es_result": {
        "hits": {
            "hits": [
                {
                    "_id": "TheFact-national-1944422",
                    "_source": {
                        "title": "충남도립대, 충남 명품수산물 요리 경연대회"
                    }
                },
                {
                    "_id": "fnnews-livingculture-202206101059176735",
                    "_source": {
                        "title": "제주 드림타워 “일식당 유메야마서 새 메뉴 출시“"
                    }
                },
                {
                    "_id": "joongang-25078039",
                    "_source": {
                        "title": "‘오겜’ 음악감독, 세계적 레이블 데카와 손잡았다"
                    }
                },
                {
                    "_id": "mk-202206508939",
                    "_source": {
                        "title": "[MK 6월 3주 바다낚시] 귀어에 대한 꿈을 꾸고 있다면"
                    }
                },
                {
                    "_id": "news1-4707998",
                    "_source": {
                        "title": "롯데관광개발, 그랜드 하얏트 제주 일식당 ‘유메야마‘ 할인 프로모션"
                    }
                },
                {
                    "_id": "khan-opinion-202206100300035",
                    "_source": {
                        "title": "북극은 지금, 불덩이 바다"
                    }
                },
                {
                    "_id": "mk-202206509450",
                    "_source": {
                        "title": "“K팝 vs J팝, 어느쪽이 인기?“ 일본인들도 “K팝“ 인정"
                    }
                },
                {
                    "_id": "hani-society-1046416",
                    "_source": {
                        "title": "6월 10일 동정"
                    }
                },
                {
                    "_id": "yna-AKR20220609056700003",
                    "_source": {
                        "title": "GS리테일 퀵커머스 ‘요마트‘ “축산 등 신선식품이 인기“"
                    }
                },
                {
                    "_id": "edaily-01230006632360408",
                    "_source": {
                        "title": "[밀라노에서 온 편지]디자인 도시 밀라노에 부는 ‘K‘바람"
                    }
                },
                {
                    "_id": "hani-economy-1046478",
                    "_source": {
                        "title": "때 이른 무더위, 호텔 보양식으로 이겨내 볼까?"
                    }
                },
                {
                    "_id": "news1-4706872",
                    "_source": {
                        "title": "한류, 일본 짓눌렀다…한일 양국서 ‘K-컬쳐 위상 더 높다‘ 여론 우세"
                    }
                },
                {
                    "_id": "munhwa-2022060901031239342001",
                    "_source": {
                        "title": "서울시, 내달 50명 간부공무원 참여 ‘정책 연찬회’ 열어"
                    }
                },
                {
                    "_id": "itchosun-2022060901219",
                    "_source": {
                        "title": "‘요마트‘ 신선식품 매출 비중 38.1%"
                    }
                },
                {
                    "_id": "hani-society-1046125",
                    "_source": {
                        "title": "‘국민 생선’, 30년 만에 명태에서 이것으로 바뀐 이유"
                    }
                },
                {
                    "_id": "news1-4706825",
                    "_source": {
                        "title": "“수원시농수산물도매시장 수산물, 중금속 걱정 마세요“"
                    }
                },
                {
                    "_id": "heraldcorp-20220609000161",
                    "_source": {
                        "title": "GS리테일, ‘요마트’ 장바구니 보니…매출1위는 우삼겹구이"
                    }
                },
                {
                    "_id": "newsis-NISX20220609_0001902081",
                    "_source": {
                        "title": "수원시농수산물도매시장 수산물, 안심하고 드세요"
                    }
                },
                {
                    "_id": "yna-AKR20220609081600005",
                    "_source": {
                        "title": "‘오징어게임‘ 음악감독 정재일, 세계적 레이블 데카와 계약"
                    }
                },
                {
                    "_id": "news1-4706344",
                    "_source": {
                        "title": "요마트서 뭐가 잘 팔렸나 보니…1위는 ‘우삼겹구이‘"
                    }
                },
                {
                    "_id": "joongang-25077786",
                    "_source": {
                        "title": "코리아부와 샤이 K팝 팬을 넘어"
                    }
                },
                {
                    "_id": "segye-20220607521051",
                    "_source": {
                        "title": "울릉 농수특산물 온라인 쇼핑몰 ‘울릉몰‘ 8일 개장"
                    }
                },
                {
                    "_id": "TheFact-economy-1944248",
                    "_source": {
                        "title": "[엔터Biz] CGV, 5년 만에 코스피200 제외…악재일까 호재일까"
                    }
                },
                {
                    "_id": "fnnews-livingculture-202206090918512875",
                    "_source": {
                        "title": "GS리테일 “‘요마트‘ 베스트 상품 1위는 우삼겹“"
                    }
                },
                {
                    "_id": "lawissue-202206090852398000204ead0791_12",
                    "_source": {
                        "title": "GS리테일, ‘요마트’ 상위 베스트 5가지 상품 모두 축산류로 분석돼"
                    }
                },
                {
                    "_id": "mt-2022060908222037433",
                    "_source": {
                        "title": "‘요마트‘ 가장 많이 팔린 상품 1위는 ‘우삼겹구이‘"
                    }
                },
                {
                    "_id": "sedaily-2675YI016N",
                    "_source": {
                        "title": "“우럭 가격을 확 낮췄다“…물가 상승에 빛 발한 롯데마트 로컬MD"
                    }
                },
                {
                    "_id": "newsis-NISX20220608_0001899816",
                    "_source": {
                        "title": "[교육소식] 우송정보대, 대한산업보건협회와 산학협력 등"
                    }
                },
                {
                    "_id": "sportskhan-202206082050003540101",
                    "_source": {
                        "title": "유명 연예인·스포츠인 얼굴·이름 무단 사용하면 법적 제재"
                    }
                },
                {
                    "_id": "fnnews-livingculture-202206081002335637",
                    "_source": {
                        "title": "조선호텔, ‘중국식 냉면‘ 등 신제품 3종 출시"
                    }
                },
                {
                    "_id": "yna-AKR20220608034300063",
                    "_source": {
                        "title": "유명 연예인·스포츠인 얼굴·이름 무단 사용하면 법적 제재"
                    }
                },
                {
                    "_id": "heraldcorp-20220607000745",
                    "_source": {
                        "title": "“얼마나 급했으면 또 지겨운 좀비냐” 넷플릭스, ‘이 분’ 부활"
                    }
                },
                {
                    "_id": "sedaily-2675JX959W",
                    "_source": {
                        "title": "정부 물량 공세에도 여전히 金징어·金태"
                    }
                },
                {
                    "_id": "yna-AKR20220607129000053",
                    "_source": {
                        "title": "울릉 농수특산물 온라인 쇼핑몰 ‘울릉몰‘ 8일 개장"
                    }
                },
                {
                    "_id": "mt-2022060710270913157",
                    "_source": {
                        "title": "“K-좀비가 돌아온다“ 넷플릭스 ‘지금 우리 학교는‘ 시즌2 제작"
                    }
                },
                {
                    "_id": "khan-economy-202206091747001",
                    "_source": {
                        "title": "퀵커머스 ‘요마트‘ 장보기 매출 보니…우삼겹구이 1등"
                    }
                },
                {
                    "_id": "yna-AKR20220607017500005",
                    "_source": {
                        "title": "넷플릭스, ‘지금 우리 학교는‘ 시즌2 제작 확정"
                    }
                },
                {
                    "_id": "sisajournal-240122",
                    "_source": {
                        "title": "北 미사일 바라보는 日 정부와 시민들 ‘온도차 뚜렷’"
                    }
                },
                {
                    "_id": "asiae-2022053008591858739",
                    "_source": {
                        "title": "디저트로 떠나는 제주 여행"
                    }
                },
                {
                    "_id": "mk-202206497151",
                    "_source": {
                        "title": "넷플릭스 ‘지금 우리 학교는‘ 후속편 제작 확정"
                    }
                },
                {
                    "_id": "newsis-NISX20220607_0001899171",
                    "_source": {
                        "title": "울릉군, 농수특산물 온라인 쇼핑몰 ‘울릉몰’ 오픈"
                    }
                },
                {
                    "_id": "fnnews-society-202206070834149204",
                    "_source": {
                        "title": "경기도, 주꾸미 10만 마리 화성·안산·시흥 연안 방류"
                    }
                },
                {
                    "_id": "newsis-NISX20220607_0001898424",
                    "_source": {
                        "title": "경기도, 어린 주꾸미 10만마리 화성·안산·시흥 연안 방류"
                    }
                },
                {
                    "_id": "edaily-01836806632359424",
                    "_source": {
                        "title": "‘4차산업 시대’ IP 교양서 ‘스타트업 특허 바이블’"
                    }
                },
                {
                    "_id": "joongang-25077420",
                    "_source": {
                        "title": "칸 접수한 K콘텐트, 그 뒤엔 ‘할리우드형 스튜디오’"
                    }
                },
                {
                    "_id": "newsis-NISX20220609_0001901040",
                    "_source": {
                        "title": "[집중 인터뷰]송강호라는 공기, 송강호라는 뒷배"
                    }
                },
                {
                    "_id": "joongang-25077099",
                    "_source": {
                        "title": "‘친환경’ 입고, 레드카펫 오른 그녀들"
                    }
                },
                {
                    "_id": "chosun-7RO5MRX53JGYXAQCJXU6WUMP5M",
                    "_source": {
                        "title": "[신문은 선생님] [재미있는 과학] 싫은 사람 보면 물 내뿜는 문어… 사투리 쓰는 범고래"
                    }
                },
                {
                    "_id": "joongang-25076467",
                    "_source": {
                        "title": "오징어·바지락·새우 듬뿍, 프라이팬밥…와인 안주로 훌륭해요 [쿠킹]"
                    }
                },
                {
                    "_id": "sisajournal-239236",
                    "_source": {
                        "title": "위기에 빠진 토종 OTT, 해외서 탈출구 찾는다"
                    }
                },
                {
                    "_id": "joongang-25077329",
                    "_source": {
                        "title": "‘브로커‘도 ‘헌트‘도 할리우드 시스템…“K콘텐트 세계화 뒷받침“"
                    }
                },
                {
                    "_id": "inews24-1487419",
                    "_source": {
                        "title": "73개 가공식품 중 4개 빼고 다 올랐다…물가 10년만에 최고"
                    }
                },
                {
                    "_id": "newsis-NISX20220605_0001897123",
                    "_source": {
                        "title": "김해국제의생명과학축제 17~18일 개최…미래먹거리산업 육성"
                    }
                },
                {
                    "_id": "joongang-25076935",
                    "_source": {
                        "title": "그녀가 입은 드레스의 마법…칸 레드카펫이 ‘그린카펫‘ 됐다"
                    }
                },
                {
                    "_id": "segye-20220606512368",
                    "_source": {
                        "title": "“동물도 ‘법적 권리’ 누리는 세상 꿈꿔요” [차 한잔 나누며]"
                    }
                },
                {
                    "_id": "edaily-01295606632359096",
                    "_source": {
                        "title": "국수·식용유값 고공행진…73개 가공식품 중 69개품목 올라"
                    }
                },
                {
                    "_id": "moneys-2022060417382515705",
                    "_source": {
                        "title": "반크 “판소리, 중국문화 아닌 한국의 전통소리“ 시정 캠페인"
                    }
                },
                {
                    "_id": "sisajournal-239328",
                    "_source": {
                        "title": "파라마운트+ 가세한 OTT 대전, 승자는 누가 될까"
                    }
                },
                {
                    "_id": "sedaily-2674M2MCNO",
                    "_source": {
                        "title": "고급 양복부터 연예인 인맥·슈퍼카까지…‘청년재력가‘ 사기꾼들의 특징"
                    }
                },
                {
                    "_id": "munhwa-2022060501039910025001",
                    "_source": {
                        "title": "“보전금 받아도…가게 어려워”…6월도 소상공인 ‘흐림’"
                    }
                },
                {
                    "_id": "mk-202206494924",
                    "_source": {
                        "title": "“파리만 날려요“…지갑 닫은 손님에 수산시장 상인들 ‘한숨‘[르포]"
                    }
                },
                {
                    "_id": "mk-202206493240",
                    "_source": {
                        "title": "“하다하다 ‘판소리‘까지 ‘중국 유산‘?“…황당 주장에 반크 시정 캠페인"
                    }
                },
                {
                    "_id": "joongang-25076951",
                    "_source": {
                        "title": "국수 33%↑·식용유 23%↑…가공식품 7.6%↑, 10년만에 최고 상승"
                    }
                },
                {
                    "_id": "economist-20220606140007109",
                    "_source": {
                        "title": "“4개 빼고 다 올랐다”…국수·식용유 등 가공식품 10년 만에 최고 상승"
                    }
                },
                {
                    "_id": "heraldcorp-20220604000051",
                    "_source": {
                        "title": "해수부, 다음달 3일까지 총 2300톤 비축수산물 푼다…물가 안정 총력"
                    }
                },
                {
                    "_id": "joongang-25076741",
                    "_source": {
                        "title": "中백과사전 버젓이 “판소리는 조선족 유산“…반크 “이게 뭔 소리“"
                    }
                },
                {
                    "_id": "segye-20220606514498",
                    "_source": {
                        "title": "가공식품 물가 10년 만에 최고…저소득층 ‘밥상 물가‘ 어쩌나 [한강로 경제브리핑]"
                    }
                },
                {
                    "_id": "asiae-2022060614383868936",
                    "_source": {
                        "title": "‘서민 식품‘ 국수·밀가루까지…가공식품 가격도 10년 만에 최고 상승"
                    }
                },
                {
                    "_id": "heraldcorp-20220606000004",
                    "_source": {
                        "title": "국수 33%↑·밀가루 26%↑…67개 가공식품 가격 올랐다"
                    }
                },
                {
                    "_id": "heraldcorp-20220603000654",
                    "_source": {
                        "title": "“마동석 주먹이 낫겠다” 볼 게 없는 넷플릭스, 큰일 나겠네"
                    }
                }
            ]
        }
    }
}

es_result0 = {
    "es_result": {
        "hits": {
            "hits": [
                {
                    "_id": "edaily-01430086632360408",
                    "_source": {
                        "title": "“긴축 칼날 빼든 ECB·中코로나 규제, 한국 증시에 부담“"
                    }
                },
                {
                    "_id": "news1-4707368",
                    "_source": {
                        "title": "코인 업권법, 빨라야 2024년 시행…업계 ‘자율규제‘ 강도 세진다"
                    }
                },
                {
                    "_id": "segye-20220609524501",
                    "_source": {
                        "title": "종부세·규제 완화 긍정적… “구체안 없어 평가 일러“ 신중론도"
                    }
                },
                {
                    "_id": "edaily-02233686632360408",
                    "_source": {
                        "title": "日, 2년만에 국경 열었지만…英여행사 “규제 여전·절차도 복잡“"
                    }
                },
                {
                    "_id": "newsis-NISX20220608_0001900892",
                    "_source": {
                        "title": "기술·혁신도 ‘무용지물‘…스타트업 ‘규제 대못‘에 신음"
                    }
                },
                {
                    "_id": "edaily-01177526632360408",
                    "_source": {
                        "title": "위기대응에 벅찼던 尹경제팀…규제·세제 고쳐 민간주도성장 길 트나"
                    }
                },
                {
                    "_id": "asiae-2022060915354930753",
                    "_source": {
                        "title": "‘규제 개혁‘ 거듭 강조한 추경호…“기업 발목 잡는 규제 과감히 혁파“"
                    }
                },
                {
                    "_id": "donga-20220610113872294",
                    "_source": {
                        "title": "수도권 첨단학과, 규제 막혀 학생 못늘려 PDF지면보기"
                    }
                },
                {
                    "_id": "mt-2022060913192061296",
                    "_source": {
                        "title": "노동규제 혁신TF 본격 가동…“중복절차·낡은 규제 찾아 개혁“"
                    }
                },
                {
                    "_id": "TheFact-national-1944011",
                    "_source": {
                        "title": "완도군, 규제 개선 2건 중앙부처서 수용"
                    }
                },
                {
                    "_id": "etnews-02-20220609000146",
                    "_source": {
                        "title": "보험사 건전성 규제 숨통 트인다"
                    }
                },
                {
                    "_id": "segye-20220609521017",
                    "_source": {
                        "title": "美 총기 규제 첫발 뗐지만… 법안화 ‘산 넘어 산’"
                    }
                },
                {
                    "_id": "edaily-01922086632360080",
                    "_source": {
                        "title": "[특징주]규제 개선 기대감에 로봇주 강세"
                    }
                },
                {
                    "_id": "news1-4707273",
                    "_source": {
                        "title": "총리실 전담 ‘규제개혁‘ 기재부가 총대…그립 세게 쥐는 추경호"
                    }
                },
                {
                    "_id": "legaltimes-67098",
                    "_source": {
                        "title": "“조각투자 금융규제, 샌드박스 신청 필요“"
                    }
                },
                {
                    "_id": "lawtimes-179130",
                    "_source": {
                        "title": "플랫폼 기업 규제, 민관협의체로 넘어갈까?"
                    }
                },
                {
                    "_id": "news1-4707315",
                    "_source": {
                        "title": "광주시, 광고물 바탕색 사용 제한 ‘폐지‘...화장시설 운영 규제 ‘존치‘"
                    }
                },
                {
                    "_id": "asiae-2022060908163932049",
                    "_source": {
                        "title": "추경호 부총리 “기업 규제 과감히 철폐…이달중 혁신 TF 출범“"
                    }
                },
                {
                    "_id": "news1-4706265",
                    "_source": {
                        "title": "추경호 “기업 규제, 과감히 철폐…혁신 TF 6월 출범“"
                    }
                },
                {
                    "_id": "kmib-001715955961141111",
                    "_source": {
                        "title": "갈팡질팡 암호화폐 규제안… ‘스스로 규제’에 업계 ‘당혹’"
                    }
                },
                {
                    "_id": "sedaily-2676HU2U5Y",
                    "_source": {
                        "title": "‘재정 정상화‘ 선언한 추경호…규제·세제 개혁으로 민간 활력"
                    }
                },
                {
                    "_id": "yna-AKR20220609084600001",
                    "_source": {
                        "title": "“기업활력 제고, 정책 목표로“…기술·사업 규제 32건 개선"
                    }
                },
                {
                    "_id": "yna-AKR20220609134300530",
                    "_source": {
                        "title": "새정부 ‘탈 규제‘ 본격화…각 부처 규제개혁TF 일제히 가동"
                    }
                },
                {
                    "_id": "yna-AKR20220610121000060",
                    "_source": {
                        "title": "가평 군수직 인수위 출범…통합·규제완화 중점"
                    }
                },
                {
                    "_id": "edaily-03375126632360080",
                    "_source": {
                        "title": "재건축 규제 완화 움직임에 들썩이는 강남 집값"
                    }
                },
                {
                    "_id": "donga-20220609113856327",
                    "_source": {
                        "title": "‘규제·세제 혁신’ 담은 경제정책방향 내주 발표…규제TF 이달 출범"
                    }
                },
                {
                    "_id": "joongang-25077768",
                    "_source": {
                        "title": "[분양 포커스] DSR 규제 안 받는 강남 하이엔드 오피스텔"
                    }
                },
                {
                    "_id": "TheFact-economy-1944036",
                    "_source": {
                        "title": "추경호 “물가·민생 안정 최우선…규제·세제 과감히 개편“"
                    }
                },
                {
                    "_id": "moneys-2022060910311687609",
                    "_source": {
                        "title": "美하원, 총기규제 강화 법안 가결… 연령 상향·신원조회 도입"
                    }
                },
                {
                    "_id": "mk-202206507119",
                    "_source": {
                        "title": "김소영 부위원장 “하반기 퇴직연금 규제 재점검“"
                    }
                },
                {
                    "_id": "moneys-2022060817233224061",
                    "_source": {
                        "title": "‘부유‘ 외쳤는데 ‘가난‘왔다… 中, 빅테크 규제 완화 움직임"
                    }
                },
                {
                    "_id": "joongang-25077893",
                    "_source": {
                        "title": "바이든 “공화당, 총기로비에 시달려…총기규제 추가 행정명령 검토”"
                    }
                },
                {
                    "_id": "newsis-NISX20220609_0001901033",
                    "_source": {
                        "title": "[속보]추경호 “기업 발목 잡는 규제 철폐…내주 경제정책방향 발표“"
                    }
                },
                {
                    "_id": "edaily-02801126632360080",
                    "_source": {
                        "title": "“신기술 인재 양성 막는 노동 규제 혁신”…규제혁신TF 첫 회의"
                    }
                },
                {
                    "_id": "yna-AKR20220609088500009",
                    "_source": {
                        "title": "바이든 “공화당, 총기로비에 시달려…총기규제 추가조치 검토“"
                    }
                },
                {
                    "_id": "news1-4706860",
                    "_source": {
                        "title": "정부, 핵심 규제 32건 중점 개선…기업활력 제고 정책 목표 삼기로"
                    }
                },
                {
                    "_id": "hankookilbo-A2022060916340005487",
                    "_source": {
                        "title": "고객 보험금 구멍 낼 보험사 수두룩…당국, 규제 풀어 구제"
                    }
                },
                {
                    "_id": "segye-20220609521110",
                    "_source": {
                        "title": "종부세·규제 완화 긍정적… ‘물가 안정’ 최우선 과제로 꼽아 [윤석열정부 출범 한 달]"
                    }
                },
                {
                    "_id": "newsis-NISX20220609_0001902432",
                    "_source": {
                        "title": "바이든 “총기 규제 11월 선거 쟁점돼야“…TV 토크쇼 출연"
                    }
                },
                {
                    "_id": "yna-AKR20220609088551009",
                    "_source": {
                        "title": "바이든 “총기규제 못하는 건 협회 로비 탓…행정명령 더낼 것“(종합)"
                    }
                },
                {
                    "_id": "moneys-2022060908165848062",
                    "_source": {
                        "title": "‘청문회 앞둔‘ 김주현, 이복현 금감원장과 첫 회동 “규제 개혁 협력“"
                    }
                },
                {
                    "_id": "mk-202206505070",
                    "_source": {
                        "title": "청약 경쟁률도 작년 반토막…비규제 많은 지방은 선방"
                    }
                },
                {
                    "_id": "zdnet-20220610131925",
                    "_source": {
                        "title": "“의료데이터, 관건은 규제와 활용의 균형“"
                    }
                },
                {
                    "_id": "mt-2022060909414514779",
                    "_source": {
                        "title": "한덕수 국무총리 “규제 혁신“ 언급에…로보티즈, 14% 오른다"
                    }
                },
                {
                    "_id": "segye-20220609511034",
                    "_source": {
                        "title": "새 정부 경제정책 16일 발표…규제·세제 고쳐 민간활력↑"
                    }
                },
                {
                    "_id": "yna-AKR20220609081300002",
                    "_source": {
                        "title": "금융당국 ‘금리 상승 직격탄‘ 보험사에 건전성 규제 완화한다"
                    }
                },
                {
                    "_id": "asiae-2022061009170935034",
                    "_source": {
                        "title": "식약처, 화장품 규제혁신 민관협의체 ‘도약! K-코스메틱‘ 출범"
                    }
                },
                {
                    "_id": "newstomato-1127786",
                    "_source": {
                        "title": "이명박·박근혜 기재부 장관들, 새 정부에 규제·노동 개혁 주문"
                    }
                },
                {
                    "_id": "mk-202206507072",
                    "_source": {
                        "title": "“블록체인산업 육성 위한 선제적 규제 개선 필요“"
                    }
                },
                {
                    "_id": "lawtimes-179356",
                    "_source": {
                        "title": "“현행법상 규제 어려운 조각투자, 자산분리 등 소비자 보호 체계 갖춰야“"
                    }
                },
                {
                    "_id": "newsis-NISX20220609_0001901449",
                    "_source": {
                        "title": "고용차관 “신기술 인재양성 막는 규제, 과감히 혁신해야“"
                    }
                },
                {
                    "_id": "newstomato-1127644",
                    "_source": {
                        "title": "새정부 경제정책방향 내주 발표…“규제·세제 과감히 개편“"
                    }
                },
                {
                    "_id": "donga-20220609113857135",
                    "_source": {
                        "title": "美하원, 총기규제 법안 가결…연령 상향·유령총 신원조회 도입"
                    }
                },
                {
                    "_id": "yna-AKR20220609109100009",
                    "_source": {
                        "title": "미 하원, 총기규제 강화안 통과…“시행 가능성 희박한 정치전략“"
                    }
                },
                {
                    "_id": "news1-4707480",
                    "_source": {
                        "title": "바이든 “총기협회 로비 탓에 총기규제 진전 안돼…11월 선거 쟁점돼야“"
                    }
                },
                {
                    "_id": "newsis-NISX20220609_0001901175",
                    "_source": {
                        "title": "추경호 “기업 규제 과감히 철폐…경제분야 규제혁신TF 출범“(종합)"
                    }
                },
                {
                    "_id": "news1-4706820",
                    "_source": {
                        "title": "국가기술자격증 증명사진 제출 파일로 대체…고용부, 규제 혁신 추진"
                    }
                },
                {
                    "_id": "newsis-NISX20220609_0001901088",
                    "_source": {
                        "title": "美하원, 총기규제 법안 가결…연령 상향·유령총 신원조회 도입"
                    }
                },
                {
                    "_id": "dailian-1121340",
                    "_source": {
                        "title": "민주, 文 사저 앞 욕설 시위 규제 ‘헤이트 스피치‘ 금지법 발의"
                    }
                },
                {
                    "_id": "dailian-1121437",
                    "_source": {
                        "title": "추경호 “다음주 경제정책방향 발표…규제·세제 과감히 개편”"
                    }
                },
                {
                    "_id": "kmib-092424931911141400",
                    "_source": {
                        "title": "美 상원 총기규제법 일부 진전"
                    }
                },
                {
                    "_id": "newsis-NISX20220609_0001902181",
                    "_source": {
                        "title": "금융당국 RBC 규제 완화에 보험사들 ‘안도‘"
                    }
                },
                {
                    "_id": "ftoday-237032",
                    "_source": {
                        "title": "추경호 부총리, “기업 발목 잡는 규제 과감히 철폐…규제혁신TF 이달 출범”"
                    }
                },
                {
                    "_id": "sedaily-2676FZACU6",
                    "_source": {
                        "title": "[특징주] 로보티즈, 한덕수 총리 ‘자율주행로봇 규제 혁신‘ 언급에 14% 급등"
                    }
                },
                {
                    "_id": "sedaily-2676GYU1EM",
                    "_source": {
                        "title": "부동산시세 자동 산정 규제 개정 착수… 카카오페이 등 혁신금융 기간 연장"
                    }
                },
                {
                    "_id": "news1-4706254",
                    "_source": {
                        "title": "[속보] 추경호 “규제·세제 과감히 개편…경제정책방향 내주 발표“"
                    }
                },
                {
                    "_id": "edaily-03591606632360080",
                    "_source": {
                        "title": "역대 경제수장들 “韓 경제 복합위기…규제 풀고 민간 자율 강화해야“"
                    }
                },
                {
                    "_id": "yna-AKR20220609107800002",
                    "_source": {
                        "title": "추경호 “기업·경제활동 발목 잡는 규제 과감히 혁파“"
                    }
                },
                {
                    "_id": "news1-4706588",
                    "_source": {
                        "title": "“시대 뒤떨어진 규제·세제 개편“…尹정부 첫 경제정책방향 16일 발표(종합2보)"
                    }
                },
                {
                    "_id": "newsis-NISX20220609_0001901046",
                    "_source": {
                        "title": "추경호 “규제·세제 과감히 개편…다음 주 경제정책방향 발표“"
                    }
                }
            ]
        }
    }
}

# print(es_result)
from tweak.clustering.factory import NncFactory
from dashi.nn_clustering.serve.nnc_service import HACTask

# threshold = 0.666
threshold = 0.92

model = NncFactory.create('HAC', threshold)
hac = HACTask(model, max_row=50)
hac_result = hac.analyze(es_result['es_result'])

print(hac_result)